app/controllers/api/products_controller.rb

  def list
    @wines = Wine.all
---
SELECT "wines".* FROM "wines"