app/controllers/wines_controller.rb

  def index
    @wines = Wine.all
---
SELECT "wines".* FROM "wines"

  def show
    @wine = Wine.find(params[:id])
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @edit = "hello world"
    @wine = Wine.find(params[:id])
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", 4]]

  def update
    @wine = Wine.find(params[:id])
    unless @wine.update(wine_params)
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "wines" SET "name" = ?, "updated_at" = ? WHERE "wines"."id" = ?  [["name", "Hello Kitty Sparkling Ros"], ["updated_at", "2016-01-19 01:44:02.584965"], ["id", 3]]

  def destroy
    @wine = Wine.find(params[:id])
    @wine.destroy
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "wines" WHERE "wines"."id" = ?  [["id", 4]]